БухЭксп/Catalogs/CW_ДоговорыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ДоговорыПоГрузоперевозкам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаЗакупку</Name>
					<Comment>с клиентом, для расходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговорНаПродажу</Name>
					<Comment>с поставщиком, для доходов по г/п</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаиморасчетыВУЕ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВеденияБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорДляВыявленияФинансовогоРезультата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОграниченияПоГруппамУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяПриложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничиватьНоменклатуру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШаблонПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечатьАкты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечатьСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодставлятьПодписиИПечатьПриЭлектроннойРассылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактироватьНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйДоговор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ДоговорыКонтрагентов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПриложенияВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьмаДляОтправкиАктов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьмаДляОтправкиСчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляОтправкиАктов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляОтправкиСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдресДляОтправкиОтчетаЭкспедитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьмаДляОтправкиОтчетаЭкспедитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечатьОтчетаЭкспедитора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьАвтогенерациюЗаявокНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пролонгация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПоследниеИспользованныеДоговоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПоследниеИспользованныеДоговоры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДокументу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитывать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ДоговорыПоГрузоперевозкам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтотОбъект.БухгалтерскийУчет Тогда		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("БухгалтерскийУчет"));
	КонецЕсли;
	
	CW_Документы.ПроверитьСоответствиедоговораУчетному(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ВалютаДоговора) Тогда 
		ВалютаДоговора = CW_Настройки.ВалютаРегламентированногоУчета();
	КонецЕсли; 
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДатаСоздания = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	НастройкаБухгалтерскийУчет = CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"УстанавливатьДляНовыхДоговоровБУ");
	
	УчетныйДоговор 								= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	ДоговорДляВыявленияФинансовогоРезультата 	= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	АгентскийДоговорНаЗакупку	= Неопределено;
	АгентскийДоговорНаПродажу	= Неопределено;
	
	БухгалтерскийУчет 			= НастройкаБухгалтерскийУчет;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	//ВРЕМЕННО!!!
	ЭтотОбъект.ПодставлятьПодписиИПечатьПриЭлектроннойРассылке = ЭтотОбъект.ПодписьИПечатьАкты 
	или ЭтотОбъект.ПодписьИПечатьСчета
	или ЭтотОбъект.ПодписьИПечатьОтчетаЭкспедитора;
	//ВРЕМЕННО!!!
	
	Закрыт = (ДатаЗакрытия <> Дата(1,1,1));
	
	Если (ЭтотОбъект.БухгалтерскийУчет) Тогда
					
		Если ДополнительныеСвойства.Свойство("ПроверитьУчетныйДоговор") Тогда
			Если ДополнительныеСвойства.ПроверитьУчетныйДоговор Тогда
				СтруктураОтвета =  ИспользуетсяВДругихДоговорахПоГрузоперевозкам();
				Если СтруктураОтвета.Отказ Тогда                            
					СтрокаДоговоров = СтрСоединить(СтруктураОтвета.МассивДоговоров,",");					
					ОбщегоНазначения.СообщитьПользователю("Учетный договор уже используется в договорах по грузоперевозкам: "+ СтрокаДоговоров,ЭтотОбъект, "УчетныйДоговор",, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	
	ЕстьПроведенныеДокументы = Ложь;
	ДополнительныеСвойства.Свойство("ЕстьПроведенныеДокументы",ЕстьПроведенныеДокументы);
	Если (ЕстьПроведенныеДокументы <> Неопределено) Тогда
		Если (ЕстьПроведенныеДокументы) Тогда
			
			Если (Организация <> Ссылка.Организация
				ИЛИ Владелец <> Ссылка.Владелец
				ИЛИ ВидДоговора <> Ссылка.ВидДоговора
				ИЛИ ВалютаДоговора <> Ссылка.ВалютаДоговора
				ИЛИ ВзаиморасчетыВУЕ <> Ссылка.ВзаиморасчетыВУЕ) Тогда
				
				Отказ = Истина;
				Сообщить("По договору существуют проведённые документы. Изменение реквизитов договора запрещено.");
				
			КонецЕсли; 
			
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

Функция ИспользуетсяВДругихДоговорахПоГрузоперевозкам()
	
	СтруктураОтвета = Новый Структура("Отказ,МассивДоговоров", Ложь, Неопределено);  
	
	//Для версии КОРП
	Если ВариантыПриложений.ЭтоВерсияКОРП() Тогда
		Возврат СтруктураОтвета;
	КонецЕсли;
	//Для версии КОРП
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоговорыПоГрузоперевозкам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ДоговорыПоГрузоперевозкам КАК CW_ДоговорыПоГрузоперевозкам
	               |ГДЕ
	               |	CW_ДоговорыПоГрузоперевозкам.УчетныйДоговор = &УчетныйДоговор
	               |	И CW_ДоговорыПоГрузоперевозкам.Ссылка <> &Ссылка
	               |	И НЕ CW_ДоговорыПоГрузоперевозкам.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("УчетныйДоговор", УчетныйДоговор);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	МассивДоговоров = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("Отказ", Истина);
	СтруктураОтвета.Вставить("МассивДоговоров", МассивДоговоров);
	
	Возврат СтруктураОтвета;

КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	// проверяем, есть ли по договору действующие параметры
	// если нет - создаем на дату договора
	Если ДатаДоговора = Дата(1,1,1) Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыДоговоров.Договор
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыДоговоров КАК CW_ПараметрыДоговоров
	               |ГДЕ
	               |	 CW_ПараметрыДоговоров.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать();
	
	// параметров не нашли, создаем новые датой договора
	Если НЕ Выборка.Следующий() Тогда
		
		Запись = РегистрыСведений.CW_ПараметрыДоговоров.СоздатьМенеджерЗаписи();
		Запись.Период     = ДатаДоговора;
		Запись.Договор    = Ссылка;
		
		Запись.ПорядокЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
		Если (НЕ ЭтотОбъект.БухгалтерскийУчет) Тогда
			Запись.ПорядокЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
		КонецЕсли; 
		
		// порядок оформления с\ф устанавливаем в зависимости от настроек пользователя 
		Запись.ПродавецПоСФСвояОрганизация = CW_Настройки.ПолучитьНастройкуПользователя(,"ПродавецПоСФСвояОрганизация");
		
		// Порядок заполнения расчетно платежных документов для с\ф
		Если ЭтотОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			Запись.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ 	= Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.Автоматически;
			ПорядокЗачетаАвансовОЗ 							= CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"СпособЗачетаАвнасовИсходящихДокументов");
		Иначе
			Запись.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ 	= Перечисления.CW_ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ.НеУчитывать;
			ПорядокЗачетаАвансовОЗ 							= CW_Настройки.ПолучитьНастройкуПользователя(ПараметрыСеанса.ТекущийПользователь,"СпособЗачетаАвнасовВходящихДокументов");
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ПорядокЗачетаАвансовОЗ) Тогда
			Запись.ПорядокЗачетаАвансовОЗ = ПорядокЗачетаАвансовОЗ;
		КонецЕсли;
			
		РегистрыСведений.CW_ПараметрыДоговоров._ЗаполнитьРеквизитыОрганизацииРус(Запись);
		РегистрыСведений.CW_ПараметрыДоговоров._ЗаполнитьРеквизитыОрганизацииАнгл(Запись, ВалютаДоговора);
		РегистрыСведений.CW_ПараметрыДоговоров._ЗаполнитьРеквизитыКонтрагента(Запись, "Рус");
		РегистрыСведений.CW_ПараметрыДоговоров._ЗаполнитьРеквизитыКонтрагента(Запись, "Англ");
		
		//Получим настрйоки пользователя
		ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
		СтруктураНастроекПользователя 	= CW_Настройки.ПолучитьНастройкиПользователя();
		
		ОсновнойПорядокОтраженияДоходов 	= Неопределено;
		ОсновнойПорядокОтраженияРасходов 	= Неопределено;
		
		СтруктураНастроекПользователя.Свойство("ОсновнойПорядокОтраженияДоходов"	, ОсновнойПорядокОтраженияДоходов);
		СтруктураНастроекПользователя.Свойство("ОсновнойПорядокОтраженияРасходов"	, ОсновнойПорядокОтраженияРасходов);
		
		Если Не ЗначениеЗаполнено(ОсновнойПорядокОтраженияДоходов) тогда
			Если ВалютаРегламентированногоУчетаРубль Тогда
				ОсновнойПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга;
			Иначе
				ОсновнойПорядокОтраженияДоходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ОсновнойПорядокОтраженияРасходов) тогда
			Если ВалютаРегламентированногоУчетаРубль Тогда
				ОсновнойПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияЗатрат.Затраты;
			Иначе
				ОсновнойПорядокОтраженияРасходов = Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам;
			КонецЕсли;
		КонецЕсли;
		
		Запись.ОсновнойПорядокОтраженияДоходов = ОсновнойПорядокОтраженияДоходов;
		Запись.ОсновнойПорядокОтраженияРасходов = ОсновнойПорядокОтраженияРасходов;
		
		Если Не ВалютаРегламентированногоУчетаРубль Тогда
			Запись.ЯзыкПечатиДокументов 			= 1;
			Запись.ВыводитьРеквизитыПриПечатиАкта 	= Ложь;
			Запись.СкрыватьКолонкиНДСвТЧСчета 		= Истина;
		КонецЕсли;
		
		Запись.Записать();
		
	КонецЕсли; 
	
	
	Если (НЕ УчетныйДоговор.Пустая()) Тогда
		
		Если (УчетныйДоговор.ПометкаУдаления <> ПометкаУдаления) Тогда
			
			об = УчетныйДоговор.ПолучитьОбъект();
			об.УстановитьПометкуУдаления(ПометкаУдаления);
			
		КонецЕсли; 
		
	КонецЕсли; 

	Если (НЕ ДоговорДляВыявленияФинансовогоРезультата.Пустая()) Тогда
		
		Если (ДоговорДляВыявленияФинансовогоРезультата.ПометкаУдаления <> ПометкаУдаления) Тогда
			
			об = ДоговорДляВыявленияФинансовогоРезультата.ПолучитьОбъект();
			об.УстановитьПометкуУдаления(ПометкаУдаления);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если (НЕ ЭтоНовый() И ПометкаУдаления) Тогда
		
		// очищаем записи регистра "последние договоры"
		НЗ = РегистрыСведений.CW_ПоследниеИспользованныеДоговоры.СоздатьНаборЗаписей();
		НЗ.Отбор.Организация.Значение = Организация;
		НЗ.Отбор.Организация.Использование = Истина;
		НЗ.Отбор.Контрагент.Значение = Владелец;
		НЗ.Отбор.Контрагент.Использование = Истина;
		НЗ.Отбор.ВидДоговора.Значение = ВидДоговора;
		НЗ.Отбор.ВидДоговора.Использование = Истина;
		НЗ.Прочитать();
		МассивУдаляемых = Новый Массив;
		Для каждого Стр Из НЗ Цикл
			Если (Стр.Договор = Ссылка) Тогда
				МассивУдаляемых.Добавить(Стр);
			КонецЕсли; 
		КонецЦикла; 
		_сф.к_УдалитьЭлементыПоМассиву(НЗ,МассивУдаляемых);
		НЗ.Записать(Истина);
		
	КонецЕсли; 
	
	// --- 
	
	// проверяем агентские договоры
	Если (ЗначениеЗаполнено(АгентскийДоговорНаЗакупку)) Тогда
		Если (АгентскийДоговорНаЗакупку.ПометкаУдаления <> ПометкаУдаления) Тогда
			об = АгентскийДоговорНаЗакупку.ПолучитьОбъект();
			об.УстановитьПометкуУдаления(ПометкаУдаления);
		КонецЕсли; 
	КонецЕсли;
	Если (ЗначениеЗаполнено(АгентскийДоговорНаПродажу)) Тогда
		Если (АгентскийДоговорНаПродажу.ПометкаУдаления <> ПометкаУдаления) Тогда
			об = АгентскийДоговорНаПродажу.ПолучитьОбъект();
			об.УстановитьПометкуУдаления(ПометкаУдаления);
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры


  
#КонецЕсли
